src/bsl/InformationRegisters/гкс_ПодтвержденияДоставкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПодтвержденияДоставкиСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияИсходящихСообщенийRMQ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеПоОшибкеСформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_НаправлениеНаРазгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СостоянияИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СостоянияИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияИсходящихСообщенийRMQ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестноеВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УчастникиОбменаRMQ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДатаСобытияВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкиПодтвержденияДоставкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкиПодтвержденияДоставкиСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючИдентификатораСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПолучателиДанныхRMQ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ОчередьСобытийДляОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ОчередьСобытийДляОповещений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПодпискиНаРассылкиИОповещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникОповещения</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_СостоянияИсходящихСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияИсходящихСообщенийRMQ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленоИОбработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиПолучателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаФормированияСостояния</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиЗакрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Catalogs/ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УниверсальнаяДатаСобытияВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверОчередей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерверыОчередейRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКлючСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневойИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ОбъектСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_НастройкаПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПолучателиДанныхRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтракта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСостав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыгруженныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Comment>АПК:304 - №697.1.2 Обновление предопределенных данных вместо Авто требуется установить Не обновлять автоматически, так как предопределенные элементы сопоставляются с данными программно</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Например, "ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Comment>Например, "ПланВидовХарактеристик.ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПустойСсылки</Name>
					<Comment>АПК:1330 - №728.2.1 Допустимо использование универсального ссылочного типа, так как это универсальный механизм и мало данных</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъектаМетаданных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/CommonModules/гкс_ПодтверждениеДоставкиСообщений/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик регламентного задания гкс_ОповещениеОПроблемахДоставкиСообщений
//
Процедура ОповещениеОПроблемахДоставкиСообщенийСРПВ() Экспорт

	РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ОповещениеОПроблемахДоставкиСообщенийСРПВ;
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);

	УстановитьПривилегированныйРежим(Истина);

	ЗаписьЖурналаРегистрации(РегламентноеЗадание.Представление(),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Начато регламентное задание оповещения о проблемах обмена с СРПВ.'"));

	Если Не (ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений")
		И ПолучитьФункциональнуюОпцию("ИспользоватьЭлектроннуюПочтуВШаблонахСообщений")) Тогда

		Текст = НСтр("ru = 'Регламентное задание недоступно по функциональным опциям:
						|<Использовать шаблоны сообщений>/<Использовать электронную почту в шаблонах сообщений>.
						|Выполнение прервано. Задание отключено.'");
		РегламентныеЗаданияСервер.ОтменитьВыполнениеЗадания(РегламентноеЗадание, Текст);
		Возврат;
	КонецЕсли;

	ВыполнитьОповещениеДляПроблемПодготовкиОтправки();
	ВыполнитьОповещениеДляПроблемДоставкиОбработки();

	ЗаписьЖурналаРегистрации(РегламентноеЗадание.Представление(),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Закончено регламентное задание оповещения о проблемах обмена с СРПВ.'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик подписки на событие "При записи" регистра Состояния исходящих сообщений.
// Извлекает из источника сообщения, для которых существуют Настройки подтверждения доставки,
// и добавляет записи в регистр Подтверждения доставки сообщений.
//
// Параметры:
//  Источник	 - РегистрСведенийНаборЗаписей.гкс_СостоянияИсходящихСообщений - набор записей для извлечения и фиксации событий.
//  Отказ		 - Булево - возможность отказаться от записи набора-источника.
//  Замещение	 - Булево - режим записи набора-источника.
//
Процедура ЗафиксироватьСобытиеДляПодтверждениеДоставки(Источник, Отказ, Замещение) Экспорт

	Если Не Источник.Количество() Тогда
		Возврат;
	КонецЕсли;

	КоллекцияСообщений 	= КоллекцияСообщенийДляОбработки(Источник.Отбор);
	Если КоллекцияСообщений = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МенеджерРегистра 	= РегистрыСведений.гкс_ПодтвержденияДоставкиСообщений;
	НаборЗаписей		= МенеджерРегистра.СоздатьНаборЗаписей();
	Для Каждого СтрокаКоллекции Из КоллекцияСообщений Цикл

		Если Не ЗначениеЗаполнено(СтрокаКоллекции.КлючИдентификатораСобытия) Тогда
			Продолжить;
		КонецЕсли;

		Если МенеджерРегистра.СостояниеСообщенияОтражено(
			СтрокаКоллекции.Состояние, СтрокаКоллекции.ИдентификаторСообщения) Тогда
			Продолжить;
		КонецЕсли;

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Период = ТекущаяДатаСеанса();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаКоллекции);
		Попытка

			ЗаписьНабора.ИдентификаторСобытия = ИзвлечьИдентификаторСобытия(
				СтрокаКоллекции.Сообщение, СтрокаКоллекции.КлючИдентификатораСобытия);

		Исключение

			ИнформацияОбОшибке 				= ИнформацияОбОшибке();
			КраткоеПредставлениеОшибки 		= ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ПодробноеПредставлениеОшибки 	= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ПредставлениеОшибкиДляЖурнала 	= СтрШаблон(
				НСтр("ru = 'Не удалось извлечь Идентификатор события из сообщения!
					|Источник: %1
					|Идентификатор сообщения: %2
					|============================================================================
					|%3
					|============================================================================
					|%4'"),
				СтрокаКоллекции.Источник,
				СтрокаКоллекции.ИдентификаторСообщения,
				СтрокаКоллекции.Сообщение,
				ПодробноеПредставлениеОшибки);

			ЗаписьНабора.ОписаниеОшибки = КраткоеПредставлениеОшибки;
			ЗаписьНабора.Состояние		= Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаФормированияСостояния;

			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				СтрокаКоллекции.Источник.Метаданные(),
				СтрокаКоллекции.Источник,
				ПредставлениеОшибкиДляЖурнала);

		КонецПопытки;

	КонецЦикла;

	ЗаписатьНаборПодтвержденияДоставки(НаборЗаписей);

КонецПроцедуры

// Обработчик входящих сообщений. Добавляет в регистр Подтверждения доставки сообщений запись
// по полученным данным.
//
// Параметры:
//  ДанныеСообщения - Структура - Данные полученного сообщения.
//
// Возвращаемое значение:
//  Структура - Обработать входящее сообщение:
// * Успешно - Булево - Истина, если сообщение обработано без ошибок.
// * Источник - Неопределено, ДокументСсылка.гкс_НаправлениеНаРазгрузку - найденный по входящим данным источник события.
Функция ОбработатьВходящееСообщение(ДанныеСообщения) Экспорт

	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно", 	Истина);
	РезультатОбработки.Вставить("Источник", Неопределено);

	МенеджерРегистра 			= РегистрыСведений.гкс_ПодтвержденияДоставкиСообщений;
	НаборЗаписей				= МенеджерРегистра.СоздатьНаборЗаписей();

	ИдентификаторСобытия		= ДанныеСообщения.messageId;
	РезультатОбработки.Источник	= МенеджерРегистра.ИсточникПоИдентификаторуСобытия(ИдентификаторСобытия);
	Если РезультатОбработки.Источник = Неопределено Тогда

		ПредставлениеОшибкиДляЖурнала 	= СтрШаблон(
			НСтр("ru = 'Не удалось определить источник по идентификатору события!
				|============================================================================
				|%1'"),
			ИдентификаторСобытия);

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			НаборЗаписей.Метаданные(),,
			ПредставлениеОшибкиДляЖурнала);

	КонецЕсли;

	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Период 				= ТекущаяДатаСеанса();
	ЗаписьНабора.Источник 				= РезультатОбработки.Источник;
	ЗаписьНабора.ИдентификаторСобытия 	= ИдентификаторСобытия;
	ЗаписьНабора.ИдентификаторСообщения = ДанныеСообщения.ИдентификаторСообщения;
	ЗаписьНабора.ОписаниеОшибки 		= ДанныеСообщения.Error;
	Если ДанныеСообщения.Success = Истина Тогда
		ЗаписьНабора.Состояние = МенеджерРегистра.СостояниеУспешноДляВходящегоСообщения();
	Иначе
		ЗаписьНабора.Состояние = МенеджерРегистра.СостояниеОшибкаДляВходящегоСообщения();
	КонецЕсли;

	Если Не ЗаписатьНаборПодтвержденияДоставки(НаборЗаписей) Тогда
		РезультатОбработки.Успешно = Ложь;
	КонецЕсли;

	Возврат РезультатОбработки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытияЖурналаРегистрации()
	Возврат НСтр("ru = 'Подтверждение доставки сообщений'");
КонецФункции

Функция ИзвлечьИдентификаторСобытия(Сообщение, КлючИдентификатораСобытия)

	РезультатПриведения = КоннекторHTTP.JsonВОбъект(Сообщение);
	Возврат РезультатПриведения.Получить(КлючИдентификатораСобытия);

КонецФункции

Функция КоллекцияСообщенийДляОбработки(Отбор)

	КоллекцияСообщений = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаКоллекцииСообщенийДляОбработки();
	Для Каждого КлючЗначение Из Отбор Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Имя, КлючЗначение.Значение);
	КонецЦикла;

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		КоллекцияСообщений = РезультатЗапроса.Выгрузить();
	КонецЕсли;

	Возврат КоллекцияСообщений;

КонецФункции

Функция ТекстЗапросаКоллекцииСообщенийДляОбработки()
	Возврат
	"ВЫБРАТЬ
	|	СостоянияИсходящихСообщений.Состояние КАК Состояние,
	|	СправочникИсходящиеСообщения.Сообщение КАК Сообщение,
	|	СправочникИсходящиеСообщения.гкс_ОбъектСобытия КАК ОбъектСобытия,
	|	СправочникИсходящиеСообщения.гкс_НастройкаПолучателя КАК НастройкаПолучателя,
	|	СправочникИсходящиеСообщения.ИдентификаторСообщения КАК ИдентификаторСообщения
	|ПОМЕСТИТЬ СостоянияИсходящихСообщений
	|ИЗ
	|	РегистрСведений.гкс_СостоянияИсходящихСообщений КАК СостоянияИсходящихСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсходящиеСообщения КАК СправочникИсходящиеСообщения
	|		ПО СостоянияИсходящихСообщений.Сообщение = СправочникИсходящиеСообщения.Ссылка
	|ГДЕ
	|	СостоянияИсходящихСообщений.Сообщение = &Сообщение
	|	И СостоянияИсходящихСообщений.УчастникОбмена = &УчастникОбмена
	|	И СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = &УниверсальнаяДатаСобытияВМиллисекундах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияИсходящихСообщений.Состояние КАК Состояние,
	|	СостоянияИсходящихСообщений.Сообщение КАК Сообщение,
	|	СостоянияИсходящихСообщений.ОбъектСобытия КАК ОбъектСобытия,
	|	СостоянияИсходящихСообщений.НастройкаПолучателя КАК НастройкаПолучателя,
	|	СостоянияИсходящихСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ЕСТЬNULL(ИдентификаторыОбъектовМетаданных.Ссылка, ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)) КАК ТипОбъектаСобытия
	|ПОМЕСТИТЬ СообщенияДляОбработки
	|ИЗ
	|	СостоянияИсходящихСообщений КАК СостоянияИсходящихСообщений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО (ТИПЗНАЧЕНИЯ(СостоянияИсходящихСообщений.ОбъектСобытия) = ТИПЗНАЧЕНИЯ(ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СообщенияДляОбработки.Состояние КАК Состояние,
	|	СообщенияДляОбработки.Сообщение КАК Сообщение,
	|	СообщенияДляОбработки.ОбъектСобытия КАК Источник,
	|	СообщенияДляОбработки.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	НастройкиПодтвержденияДоставкиСообщений.КлючИдентификатораСобытия КАК КлючИдентификатораСобытия
	|ИЗ
	|	СообщенияДляОбработки КАК СообщенияДляОбработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкиПодтвержденияДоставкиСообщений КАК НастройкиПодтвержденияДоставкиСообщений
	|		ПО СообщенияДляОбработки.НастройкаПолучателя = НастройкиПодтвержденияДоставкиСообщений.НастройкаПолучателя
	|			И СообщенияДляОбработки.ТипОбъектаСобытия = НастройкиПодтвержденияДоставкиСообщений.ТипОбъектаСобытия";
КонецФункции

Функция ЗаписатьНаборПодтвержденияДоставки(НаборЗаписей)

	Отказ = Ложь;

	Попытка

		Если НаборЗаписей.Количество() Тогда
			НаборЗаписей.Записать(РежимЗамещения.Слияние);
		КонецЕсли;

	Исключение

		Отказ = Истина;
		ИнформацияОбОшибке 				= ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки 	= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ПредставлениеОшибкиДляЖурнала 	= СтрШаблон(
			НСтр("ru = 'Не удалось зафиксировать данные для подтверждения доставки сообщения!
				|============================================================================
				|%1'"),
			ПодробноеПредставлениеОшибки);

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			НаборЗаписей.Метаданные(),,
			ПредставлениеОшибкиДляЖурнала);

	КонецПопытки;

	Возврат Не Отказ;

КонецФункции

Процедура ВыполнитьОповещениеДляПроблемПодготовкиОтправки()

	Подписка = Справочники.гкс_ПодпискиНаРассылкиИОповещения.ПроблемыПодготовкиОтправкиСообщенийДляСРПВ;
	Если Не ПодпискаНаРассылкуИспользуется(Подписка) Тогда
		Возврат;
	КонецЕсли;

	ПроблемныеСостояния = Новый Массив;
	ПроблемныеСостояния.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.Подготовлено);
	ПроблемныеСостояния.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаФормированияСостояния);

	ОбработатьПроблемныеСообщения(Подписка, ПроблемныеСостояния);

КонецПроцедуры

Процедура ВыполнитьОповещениеДляПроблемДоставкиОбработки()

	Подписка = Справочники.гкс_ПодпискиНаРассылкиИОповещения.ПроблемыДоставкиОбработкиСообщенийОтСРПВ;
	Если Не ПодпискаНаРассылкуИспользуется(Подписка) Тогда
		Возврат;
	КонецЕсли;

	ПроблемныеСостояния = Новый Массив;
	ПроблемныеСостояния.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.Отправлено);
	ПроблемныеСостояния.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаОбработкиПолучателем);

	ОбработатьПроблемныеСообщения(Подписка, ПроблемныеСостояния);

КонецПроцедуры

Функция РезультатЗапросаПоПроблемнымСостояниям(ДатаАктуальности, ПроблемныеСостояния)

	ПериодОжиданияОтветаОтСРПВ = Константы.гкс_ПериодОжиданияОтветаОтСРПВ.Получить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаАктуальности);
	Запрос.УстановитьПараметр("ПроблемныеСостояния", ПроблемныеСостояния);
	Запрос.УстановитьПараметр("ПериодОжиданияОтветаОтСРПВ", ПериодОжиданияОтветаОтСРПВ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтвержденияДоставкиСообщений.Период КАК Период,
	|	ПодтвержденияДоставкиСообщений.Источник КАК Источник,
	|	ПодтвержденияДоставкиСообщений.Состояние КАК Состояние,
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ПодтвержденияДоставкиСообщений.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ИСТИНА КАК УведомлениеПоОшибкеСформировано
	|ПОМЕСТИТЬ ПодтвержденияДоставкиСообщений
	|ИЗ
	|	РегистрСведений.гкс_ПодтвержденияДоставкиСообщений.СрезПоследних(, РАЗНОСТЬДАТ(Период, &ТекущаяДата,
	|		СЕКУНДА) > &ПериодОжиданияОтветаОтСРПВ) КАК ПодтвержденияДоставкиСообщений
	|ГДЕ
	|	ПодтвержденияДоставкиСообщений.Состояние В (&ПроблемныеСостояния)
	|	И НЕ ПодтвержденияДоставкиСообщений.УведомлениеПоОшибкеСформировано
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодтвержденияДоставкиСообщений.Период КАК Период,
	|	ПодтвержденияДоставкиСообщений.Источник КАК Источник,
	|	ПодтвержденияДоставкиСообщений.Состояние КАК Состояние,
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ПодтвержденияДоставкиСообщений.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ПодтвержденияДоставкиСообщений.УведомлениеПоОшибкеСформировано КАК УведомлениеПоОшибкеСформировано
	|ИЗ
	|	ПодтвержденияДоставкиСообщений КАК ПодтвержденияДоставкиСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку
	|		ПО ПодтвержденияДоставкиСообщений.Источник = ДокументНаправлениеНаРазгрузку.Ссылка";
	Возврат Запрос.Выполнить();

КонецФункции

Процедура ОбработатьПроблемныеСообщения(Подписка, ПроблемныеСостояния)

	ДатаАктуальности = ТекущаяДатаСеанса();
	РезультатЗапроса = РезультатЗапросаПоПроблемнымСостояниям(ДатаАктуальности, ПроблемныеСостояния);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ИнтервалАктуальностиОповещения	= 30;
	ДатаОтправки		= гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата();
	ДатаАктуальности	= ДатаАктуальности + гкс_ОбщегоНазначенияКлиентСервер.ПересчитатьВСекунды(
		ИнтервалАктуальностиОповещения, "МИНУТА");

	НачатьТранзакцию();
	Попытка
		НаборОчередиОповещений = РегистрыСведений.гкс_ОчередьСобытийДляОповещений.СоздатьНаборЗаписей();
		НаборПодтвержденийДоставки = РегистрыСведений.гкс_ПодтвержденияДоставкиСообщений.СоздатьНаборЗаписей();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл

			ЗаписьНабора = НаборОчередиОповещений.Добавить();
			ЗаписьНабора.Период = ТекущаяДатаСеанса();
			ЗаписьНабора.Подписка = Подписка;
			ЗаписьНабора.ИсточникОповещения = Выборка.Источник;
			ЗаписьНабора.ДатаОтправки = ДатаОтправки;
			ЗаписьНабора.ДатаАктуальностиОтправки = ДатаАктуальности;

			ЗаполнитьЗначенияСвойств(НаборПодтвержденийДоставки.Добавить(), Выборка);

		КонецЦикла;

		НаборОчередиОповещений.Записать(РежимЗамещения.Слияние);
		НаборПодтвержденийДоставки.Записать(РежимЗамещения.Слияние);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;

КонецПроцедуры

Функция ПодпискаНаРассылкуИспользуется(Подписка)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подписка, "ПодпискаДействует") = Истина;

КонецФункции

#КонецОбласти
